In [1]:
import os
import sys
sys.path.append(os.pardir)

In [13]:
import json
import pathlib
import pandas as pd
from sqlalchemy.orm import sessionmaker
from credible import connectors
from credible.etl import Base, Etl, Photo, Tip, Checkin, Business

In [3]:
data_folderpath = os.path.join(os.pardir, 'data')
engine = connectors.connect_to_sqlite()

In [4]:
Session = sessionmaker(bind=engine)
etl = Etl(Base, Session, engine)

In [5]:
etl.create_all()

In [7]:
generator = pathlib.Path(data_folderpath).glob('*_x.json')

In [8]:
sorted_list = sorted(generator, key=os.path.getsize, reverse=True)
file_review, file_user, file_checkin, file_tip, file_business, file_photo = sorted_list

### Import data to Photos

In [ ]:
with open(file_photo, 'r') as json_data:
    data = json.load(json_data)
etl.bulk_insert(Photo, data)

In [ ]:
pd.read_sql_table('photos', engine).sample()

### Import data to Tips

In [ ]:
with open(file_tip, 'r') as json_data:
    data = json.load(json_data)

# requires data transformation
tips_list = []
for d in data:
    t = Tip(d)
    tips_list.append(t)

etl.bulk_insert(Tip, tips_list)

In [ ]:
pd.read_sql_table('tips', engine).sample()

### Import data to Checkins

In [10]:
with open(file_checkin, 'r') as json_data:
    data = json.load(json_data)
etl.bulk_insert(Checkin, data)

In [12]:
pd.read_sql_table('checkins', engine).sample()

,_id,business_id,date
82976,82977,VgiJuZOjvunbQf5PlpGsQA,"2014-09-22 20:17:34, 2014-11-07 14:55:22, 2014..."

### Import data to Businesses

In [14]:
with open(file_business, 'r') as json_data:
    data = json.load(json_data)
etl.bulk_insert(Business, data)

In [15]:
pd.read_sql_table('businesses', engine).sample()

,_id,business_id,name,address,city,state,postal_code,latitude,longitude,starts,review_count
165523,165524,IKCE55IgFg38af5hRRdEGA,The Dirty Drummer,3002 N Arizona Ave,Chandler,AZ,85225,33.351166,-111.842916,NaN,4